<script setup>
const advantages = [
	{
		title: 'Интуитивный формат «вопрос-ответ»',
		text: 'Выберите подходящие опции, отвечая на вопросы, и создайте соглашение, соответствующее вашим потребностям.',
		icon: 'head',
	},
	{
		title: 'Удобный интерфейс',
		text: 'Простота использования позволяет даже тем, кто не имеет юридического образования, создавать качественные документы.',
		icon: 'idea',
	},
	{
		title: 'Настройка и структурирование',
		text: 'Адаптируйте соглашения под конкретные случаи, сохраняя при этом их чёткую структуру и понятность.',
		icon: 'star',
	},
	{
		title: 'Экономия времени и усилий',
		text: 'Быстрое создание пользовательских соглашений без необходимости глубоких юридических знаний.',
		icon: 'doc',
	},
	{
		title: 'Соответствие законодательству',
		text: 'Гарантированное соответствие создаваемых документов актуальным нормативным актам.',
		icon: 'like',
	},
	{
		title: 'Снижение юридических рисков',
		text: 'Минимизация вероятности юридических ошибок благодаря проверенным юридическим формулировкам.',
		icon: 'safety',
	},
	{
		title: 'Предотвращение путаницы',
		text: 'Чёткая структура и понятные формулировки помогают избежать недоразумений между сторонами.',
		icon: 'help',
	},
]
</script>

<template>
	<section class="s-advantages">
		<div class="container">
			<div class="s-advantages-text">
				<h1>Преимущества, которые имеют значение</h1>
				<p>
					Снизьте юридические риски, обеспечьте соответствие нормативным
					требованиям и избегайте путаницы и недоразумений, используя удобный
					конструктор пользовательских соглашений.
				</p>
			</div>
			<div class="s-advantages-list">
				<MAdvantagesCard
					v-for="advantage in advantages"
					:key="advantage.title"
					v-bind="advantage"
				/>
			</div>
		</div>
	</section>
</template>

<style src="./SAdvantages.scss" lang="scss" scoped />
